{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attr": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attr": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attr": {"num_hidden": "50"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "sigmoid1", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "attr": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "attr": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attr": {"num_hidden": "50"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "sigmoid2", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3_weight", 
      "attr": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias", 
      "attr": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3", 
      "attr": {"num_hidden": "10"}, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "name": "logisticregressionoutput0", 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 2, 3, 6, 7, 10, 11, 13], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15
  ], 
  "heads": [[14, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 904]}
}