{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attr": {"axes": "(1, 0, 2)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel0", 
      "attr": {
        "axis": "0", 
        "num_outputs": "28", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t27_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 27, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t26_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 26, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t25_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 25, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t24_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 24, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t23_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 23, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t22_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 22, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t21_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 21, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t20_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 20, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t19_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 19, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t18_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 18, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t17_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 17, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t16_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 16, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t15_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 15, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t14_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 14, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t13_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 13, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t12_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 12, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t11_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 11, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t10_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 10, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t9_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 9, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t8_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 8, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t7_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 7, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t6_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 6, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t5_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 5, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t4_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 4, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t3_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 3, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t2_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 2, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t1_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 1, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_begin_state_0", 
      "attr": {
        "dtype": "float32", 
        "shape": "(0, 50)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[32, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t0_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[38, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t0_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[38, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_begin_state_1", 
      "attr": {
        "dtype": "float32", 
        "shape": "(0, 50)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul0", 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t0_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t0_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[38, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul1", 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t0_state", 
      "inputs": [[42, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t0_out", 
      "inputs": [[39, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t1_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[48, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[31, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t1_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t1_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul2", 
      "inputs": [[53, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t1_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t1_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[51, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul3", 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t1_state", 
      "inputs": [[54, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t1_out", 
      "inputs": [[52, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t2_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[60, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[30, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t2_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[63, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t2_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[63, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul4", 
      "inputs": [[65, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t2_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t2_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[63, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5", 
      "inputs": [[67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t2_state", 
      "inputs": [[66, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t2_out", 
      "inputs": [[64, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t3_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[72, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[29, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t3_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t3_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[75, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t3_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[75, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul6", 
      "inputs": [[77, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t3_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t3_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[75, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul7", 
      "inputs": [[79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t3_state", 
      "inputs": [[78, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t3_out", 
      "inputs": [[76, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t4_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[84, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[28, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t4_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t4_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[87, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t4_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[87, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul8", 
      "inputs": [[89, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t4_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t4_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[87, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul9", 
      "inputs": [[91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t4_state", 
      "inputs": [[90, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t4_out", 
      "inputs": [[88, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t5_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[96, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[27, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t5_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t5_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[99, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t5_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[99, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10", 
      "inputs": [[101, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t5_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t5_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[99, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul11", 
      "inputs": [[103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t5_state", 
      "inputs": [[102, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t5_out", 
      "inputs": [[100, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t6_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[108, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[26, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t6_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t6_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[111, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t6_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[111, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul12", 
      "inputs": [[113, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t6_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t6_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[111, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul13", 
      "inputs": [[115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t6_state", 
      "inputs": [[114, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t6_out", 
      "inputs": [[112, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t7_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[120, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[25, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t7_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t7_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[123, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t7_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[123, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul14", 
      "inputs": [[125, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t7_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t7_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[123, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul15", 
      "inputs": [[127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t7_state", 
      "inputs": [[126, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t7_out", 
      "inputs": [[124, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t8_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[132, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[24, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t8_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t8_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[135, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t8_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[135, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul16", 
      "inputs": [[137, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t8_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t8_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[135, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul17", 
      "inputs": [[139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t8_state", 
      "inputs": [[138, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t8_out", 
      "inputs": [[136, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t9_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[144, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[23, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t9_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t9_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[147, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t9_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[147, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul18", 
      "inputs": [[149, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t9_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t9_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[147, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul19", 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t9_state", 
      "inputs": [[150, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t9_out", 
      "inputs": [[148, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t10_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[156, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[22, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t10_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t10_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[159, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t10_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[159, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul20", 
      "inputs": [[161, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t10_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t10_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[159, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul21", 
      "inputs": [[163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t10_state", 
      "inputs": [[162, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t10_out", 
      "inputs": [[160, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t11_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[168, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[21, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t11_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t11_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[171, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t11_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[171, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul22", 
      "inputs": [[173, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t11_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t11_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[171, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul23", 
      "inputs": [[175, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t11_state", 
      "inputs": [[174, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t11_out", 
      "inputs": [[172, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t12_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[180, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[20, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t12_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t12_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[183, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t12_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[183, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul24", 
      "inputs": [[185, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t12_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t12_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[183, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul25", 
      "inputs": [[187, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t12_state", 
      "inputs": [[186, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t12_out", 
      "inputs": [[184, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t13_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[192, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[19, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t13_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t13_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t13_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul26", 
      "inputs": [[197, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t13_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t13_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[195, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul27", 
      "inputs": [[199, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t13_state", 
      "inputs": [[198, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t13_out", 
      "inputs": [[196, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t14_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[204, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[18, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t14_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t14_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[207, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t14_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[207, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul28", 
      "inputs": [[209, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t14_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t14_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[207, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul29", 
      "inputs": [[211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t14_state", 
      "inputs": [[210, 0, 0], [213, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t14_out", 
      "inputs": [[208, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t15_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[216, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[17, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t15_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t15_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[219, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t15_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[219, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul30", 
      "inputs": [[221, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t15_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t15_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[219, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul31", 
      "inputs": [[223, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t15_state", 
      "inputs": [[222, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation15", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t15_out", 
      "inputs": [[220, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t16_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[228, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[16, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t16_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t16_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[231, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t16_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[231, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul32", 
      "inputs": [[233, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t16_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t16_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[231, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul33", 
      "inputs": [[235, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t16_state", 
      "inputs": [[234, 0, 0], [237, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation16", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t16_out", 
      "inputs": [[232, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t17_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[240, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[15, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t17_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t17_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[243, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t17_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[243, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul34", 
      "inputs": [[245, 0, 0], [238, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t17_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t17_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[243, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul35", 
      "inputs": [[247, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t17_state", 
      "inputs": [[246, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation17", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t17_out", 
      "inputs": [[244, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t18_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[252, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus18", 
      "inputs": [[14, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t18_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t18_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[255, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t18_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[255, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul36", 
      "inputs": [[257, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t18_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t18_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[255, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul37", 
      "inputs": [[259, 0, 0], [260, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t18_state", 
      "inputs": [[258, 0, 0], [261, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t18_out", 
      "inputs": [[256, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t19_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[264, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[13, 0, 0], [265, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t19_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t19_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[267, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t19_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[267, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul38", 
      "inputs": [[269, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t19_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[267, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t19_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[267, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul39", 
      "inputs": [[271, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t19_state", 
      "inputs": [[270, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation19", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t19_out", 
      "inputs": [[268, 0, 0], [275, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t20_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[276, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus20", 
      "inputs": [[12, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t20_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t20_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[279, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t20_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[279, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul40", 
      "inputs": [[281, 0, 0], [274, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t20_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t20_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[279, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul41", 
      "inputs": [[283, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t20_state", 
      "inputs": [[282, 0, 0], [285, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation20", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t20_out", 
      "inputs": [[280, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t21_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[288, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus21", 
      "inputs": [[11, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t21_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[290, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t21_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[291, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t21_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[291, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul42", 
      "inputs": [[293, 0, 0], [286, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t21_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t21_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[291, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul43", 
      "inputs": [[295, 0, 0], [296, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t21_state", 
      "inputs": [[294, 0, 0], [297, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation21", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t21_out", 
      "inputs": [[292, 0, 0], [299, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t22_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[300, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus22", 
      "inputs": [[10, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t22_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[302, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t22_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[303, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t22_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[303, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul44", 
      "inputs": [[305, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t22_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t22_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[303, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul45", 
      "inputs": [[307, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t22_state", 
      "inputs": [[306, 0, 0], [309, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation22", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t22_out", 
      "inputs": [[304, 0, 0], [311, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t23_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[312, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus23", 
      "inputs": [[9, 0, 0], [313, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t23_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[314, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t23_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[315, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t23_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[315, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul46", 
      "inputs": [[317, 0, 0], [310, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t23_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t23_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[315, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul47", 
      "inputs": [[319, 0, 0], [320, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t23_state", 
      "inputs": [[318, 0, 0], [321, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation23", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[322, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t23_out", 
      "inputs": [[316, 0, 0], [323, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t24_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[324, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus24", 
      "inputs": [[8, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t24_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t24_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[327, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t24_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[327, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul48", 
      "inputs": [[329, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t24_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t24_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[327, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul49", 
      "inputs": [[331, 0, 0], [332, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t24_state", 
      "inputs": [[330, 0, 0], [333, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation24", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[334, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t24_out", 
      "inputs": [[328, 0, 0], [335, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t25_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[336, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus25", 
      "inputs": [[7, 0, 0], [337, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t25_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[338, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t25_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[339, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t25_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[339, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul50", 
      "inputs": [[341, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t25_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[339, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t25_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[339, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul51", 
      "inputs": [[343, 0, 0], [344, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t25_state", 
      "inputs": [[342, 0, 0], [345, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation25", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[346, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t25_out", 
      "inputs": [[340, 0, 0], [347, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t26_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[348, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus26", 
      "inputs": [[6, 0, 0], [349, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t26_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[350, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t26_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[351, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t26_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[351, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul52", 
      "inputs": [[353, 0, 0], [346, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t26_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t26_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[351, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul53", 
      "inputs": [[355, 0, 0], [356, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t26_state", 
      "inputs": [[354, 0, 0], [357, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation26", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[358, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t26_out", 
      "inputs": [[352, 0, 0], [359, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_t27_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[360, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus27", 
      "inputs": [[5, 0, 0], [361, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_t27_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[362, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t27_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[363, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t27_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[363, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul54", 
      "inputs": [[365, 0, 0], [358, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t27_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[363, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_t27_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[363, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul55", 
      "inputs": [[367, 0, 0], [368, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_t27_state", 
      "inputs": [[366, 0, 0], [369, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation27", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[370, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_t27_out", 
      "inputs": [[364, 0, 0], [371, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attr": {
        "reverse": "True", 
        "shape": "(-1, 50)"
      }, 
      "inputs": [[372, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "affine1_weight", 
      "attr": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "affine1_bias", 
      "attr": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "affine1", 
      "attr": {"num_hidden": "50"}, 
      "inputs": [[373, 0, 0], [374, 0, 0], [375, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "sigmoid1", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[376, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "affine2_weight", 
      "attr": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "affine2_bias", 
      "attr": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
