{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attr": {"axes": "(1, 0, 2)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rnn1_parameters", 
      "attr": {"__init__": "[\"fusedrnn\", {\"bidirectional\": false, \"num_hidden\": 100, \"init\": \"[\\\"xavier\\\", {\\\"rnd_type\\\": \\\"uniform\\\", \\\"magnitude\\\": 2.34, \\\"factor_type\\\": \\\"in\\\"}]\", \"mode\": \"rnn_tanh\", \"num_layers\": 1}]"}, 
      "inputs": []
    }, 
    {
      "op": "_zeros", 
      "name": "rnn1_begin_state_0", 
      "attr": {
        "dtype": "float32", 
        "shape": "(1, 0, 100)"
      }, 
      "inputs": []
    }, 
    {
      "op": "RNN", 
      "name": "rnn1_rnn", 
      "attr": {
        "bidirectional": "False", 
        "mode": "rnn_tanh", 
        "num_layers": "1", 
        "p": "0.0", 
        "state_outputs": "True", 
        "state_size": "100"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attr": {"p": "0.3"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rnn2_parameters", 
      "attr": {"__init__": "[\"fusedrnn\", {\"bidirectional\": false, \"num_hidden\": 100, \"init\": \"[\\\"xavier\\\", {\\\"rnd_type\\\": \\\"uniform\\\", \\\"magnitude\\\": 2.34, \\\"factor_type\\\": \\\"in\\\"}]\", \"mode\": \"rnn_tanh\", \"num_layers\": 1}]"}, 
      "inputs": []
    }, 
    {
      "op": "_zeros", 
      "name": "rnn2_begin_state_0", 
      "attr": {
        "dtype": "float32", 
        "shape": "(1, 0, 100)"
      }, 
      "inputs": []
    }, 
    {
      "op": "RNN", 
      "name": "rnn2_rnn", 
      "attr": {
        "bidirectional": "False", 
        "mode": "rnn_tanh", 
        "num_layers": "1", 
        "p": "0.0", 
        "state_outputs": "True", 
        "state_size": "100"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attr": {"shape": "(-1, 100)"}, 
      "inputs": [[8, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "affine1_weight", 
      "attr": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "affine1_bias", 
      "attr": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "affine1", 
      "attr": {"num_hidden": "100"}, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "sigmoid1", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "affine2_weight", 
      "attr": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "affine2_bias", 
      "attr": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "affine2", 
      "attr": {"num_hidden": "10"}, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 2, 6, 10, 11, 14, 15, 17], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    6, 
    8, 
    9, 
    10, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22
  ], 
  "heads": [[18, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 904]}
}