{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "30"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "30"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "30"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_c1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "60"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "60"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "60"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_c2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attr": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attr": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attr": {"num_hidden": "100"}, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_f1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "attr": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "attr": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attr": {"num_hidden": "100"}, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_f2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3_weight", 
      "attr": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias", 
      "attr": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3", 
      "attr": {"num_hidden": "10"}, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmaxoutput0", 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    6, 
    7, 
    11, 
    12, 
    15, 
    16, 
    19, 
    20, 
    22
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24
  ], 
  "heads": [[23, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 904]}
}