{
  "nodes": [
    {
      "op": "null", 
      "name": "input", 
      "inputs": []
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encode_weight", 
      "attr": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encode_bias", 
      "attr": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encode", 
      "attr": {"num_hidden": "100"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "sigmoid1", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "middle_weight", 
      "attr": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "middle_bias", 
      "attr": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "middle", 
      "attr": {"num_hidden": "50"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "sigmoid2", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "decode_weight", 
      "attr": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "decode_bias", 
      "attr": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "decode", 
      "attr": {"num_hidden": "100"}, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "sigmoid1", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "result_weight", 
      "attr": {"num_hidden": "784"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "result_bias", 
      "attr": {"num_hidden": "784"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "result", 
      "attr": {"num_hidden": "784"}, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "input_", 
      "inputs": []
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "name": "logisticregressionoutput0", 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 2, 3, 6, 7, 10, 11, 14, 15, 17], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19
  ], 
  "heads": [[18, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 904]}
}